---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OvalFramingWidth
source: html/c35581b7-fdeb-3b10-a69d-e9c3a6d1bd27.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OvalFramingWidth Property

"Oval Width"

## Syntax (C#)
```csharp
public static ForgeTypeId OvalFramingWidth { get; }
```